In [23]:
import pandas as pd
import numpy as np 
import os
import matplotlib

In [25]:
sch=pd.read_csv('Resources/schools_complete.csv')
sch.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [27]:
# use cleaned data from 'clean_up' notebook
stu=pd.read_csv('Resources/cleaned_students_complete.csv')
stu.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [28]:
school_data=os.path.join("Resources", "schools_complete.csv")
student_data=os.path.join("Resources", "Resources/cleaned_students_complete.csv")

In [29]:
sch.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [22]:
#check for null values in both dataframes using notnull (boolean) along with sum all zeros means no missing values

In [21]:
sch.notnull().sum()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [20]:
stu.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64